# Slicing and Subsetting with .loc and .iloc

In [1]:
import pandas as pd
import numpy as np
temperature = pd.read_csv('../../temperatures.csv', index_col=0)
temperature.head()

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

### 1. Slicing Lists:

Extract the temperature data for the first five entries using .iloc.

In [2]:
temperature.iloc[:5]

         date     city        country  avg_temp_c
0  2000-01-01  Abidjan  Côte D'Ivoire      27.293
1  2000-02-01  Abidjan  Côte D'Ivoire      27.685
2  2000-03-01  Abidjan  Côte D'Ivoire      29.061
3  2000-04-01  Abidjan  Côte D'Ivoire      28.162
4  2000-05-01  Abidjan  Côte D'Ivoire      27.547

### 2. Slicing Outer Index Level:

Set the 'date' column as the index and then slice the data to get temperatures from January 1, 2000, to March 1, 2000.

In [3]:
temp_ind_date = temperature.set_index('date').sort_index()
temp_ind_date.loc['2000-01-01':'2000-03-01']

                city        country  avg_temp_c
date
2000-01-01   Abidjan  Côte D'Ivoire      27.293
2000-01-01    Lahore       Pakistan      12.792
2000-01-01  Tangshan          China      -5.406
2000-01-01     Gizeh          Egypt      12.669
2000-01-01   Lakhnau          India      15.152
...              ...            ...         ...
2000-03-01  Shanghai          China      11.015
2000-03-01   Karachi       Pakistan      25.507
2000-03-01  Santiago          Chile       9.389
2000-03-01  New York  United States       6.391
2000-03-01    Durban   South Africa      23.997

[300 rows x 3 columns]


### 3. Slicing Inner Index Level:

Set a multi-level index with 'country' and 'city' and slice the data to get temperatures for a range of countries and cities.

In [7]:
temp_ind_co_city = temperature.set_index(['country', 'city']).sort_index()
temp_ind_co_city.loc[('Chile', 'Santiago'):('Pakistan','Lahore'), 'avg_temp_c']

country   city
Chile     Santiago    12.444
          Santiago    11.470
          Santiago     9.389
          Santiago     6.735
          Santiago     2.347
                       ...
Pakistan  Lahore      33.457
          Lahore      34.456
          Lahore      33.279
          Lahore      31.511
          Lahore         NaN
Name: avg_temp_c, Length: 9570, dtype: float64

### 4. Slicing Rows and Columns:

Set a multi-level index with 'country' and 'city' and slice the data to get temperatures for specific countries and cities while selecting only the 'avg_temp_c' column.

In [12]:
temp_ind_co_city.loc[('India', 'Hyderabad'):('India', 'New Delhi'), 'avg_temp_c']

country  city
India    Hyderabad    23.779
         Hyderabad    25.826
         Hyderabad    28.821
         Hyderabad    32.698
         Hyderabad    32.438
                       ...
         New Delhi    34.746
         New Delhi    33.066
         New Delhi    31.053
         New Delhi    29.900
         New Delhi       NaN
Name: avg_temp_c, Length: 1155, dtype: float64

### 5. Slicing Dates:

Set the 'date' column as the index and slice the data to get temperatures from August 25, 2012, to September 01, 2013.

In [20]:
temp_ind_date.loc['2012-08-25':'2013-09-01']

                  city        country  avg_temp_c
date
2012-09-01  Casablanca        Morocco      23.689
2012-09-01      Ankara         Turkey      19.767
2012-09-01  Umm Durman          Sudan      32.003
2012-09-01        Pune          India      25.208
2012-09-01       Seoul    South Korea      20.333
...                ...            ...         ...
2013-09-01     Nanjing          China         NaN
2013-09-01   New Delhi          India         NaN
2013-09-01    New York  United States      17.408
2013-09-01      Peking          China         NaN
2013-09-01        Xian          China         NaN

[1300 rows x 3 columns]

In [15]:
temperature['date'].max()

'2013-09-01'

### 6. Slicing by Partial Dates:

Set the 'date' column as the index and slice the data to get temperatures for the years 2010 to 2011.

In [23]:
temp_ind_date.loc['2010':'2011-12-31']

                  city    country  avg_temp_c
date
2010-01-01  Faisalabad   Pakistan      11.810
2010-01-01   Melbourne  Australia      20.016
2010-01-01   Chongqing      China       7.921
2010-01-01   São Paulo     Brazil      23.738
2010-01-01   Guangzhou      China      14.136
...                ...        ...         ...
2011-12-01      Nagoya      Japan       6.476
2011-12-01   Hyderabad      India      23.613
2011-12-01        Cali   Colombia      21.559
2011-12-01        Lima       Peru      18.293
2011-12-01     Bangkok   Thailand      25.021

[2400 rows x 3 columns]

### 7. Subsetting by Row/Column Number:

Use .iloc to extract a subset of rows and columns, specifically rows 2 to 5 and columns 1 to 4.

## Challenge Tasks

### 8. Combination Slicing:

Set a multi-level index with 'country' and 'city', then slice the data to get temperatures for 'Côte D'Ivoire' from January to March 2000.

### 9. Date Range Filtering:

Filter the dataset to include only temperatures recorded in the year 2005.

### 10. Multi-Level Indexing with Specific Rows and Columns:

Set a multi-level index with 'country' and 'city', then slice to get temperatures for 'Côte D'Ivoire' and 'Abidjan' for specific date ranges while selecting only the 'avg_temp_c' column.